# CableTraySize Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SpecTypeId..::..CableTraySize Property
SpecTypeId Class See Also
---
Cable Tray Size, in discipline Electrical.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId CableTraySize { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CableTraySize As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ CableTraySize {
	ForgeTypeId^ get ();
}
```

# See Also
SpecTypeId Class
Autodesk.Revit.DB Namespace